<script setup lang="ts">
definePageMeta({
   customTitle: {
      key: 'monograms'
   },

   info: {
      key: 'monograms',

      image: '/img/monograms/main.webp',

      line: {
         icon: 'stars',
         size: 'small'
      }
   }
})

const gallery = {
   standard: [
      ...Array.from({ length: 10 }).map(item => ({ path: '/img/services/2.1.webp', alt: undefined }))
   ],
   premium: [
      ...Array.from({ length: 10 }).map(item => ({ path: '/img/services/2.1.webp', alt: undefined }))
   ],
   elite: [
      ...Array.from({ length: 10 }).map(item => ({ path: '/img/services/2.1.webp', alt: undefined }))
   ],
}
</script>

<template>
   <div class="grid gap-16">
      <div class="">
         <h2 class="text-2xl uppercase font-semibold text-balance text-center px-40">
            Краткая основная информация о монограммах
         </h2>
         <Line icon="main" size="small" class="[&_.line]:min-w-60 mt-2" />
      </div>

      <div class="grid gap-4">
         <p class="text-accent-800">
            <b>Монограмма</b> представляет собой особый знак в виде сочетания первых букв имени и фамилии человека. Это
            особенный художественный символ. Буквы соединяются (переплетаются) между собой таким образом, что их
            графическое начертание, в конечном итоге, представляет собой эстетическую визуальную композицию в
            индивидуальном стиле, наделенную дополнительным смыслом и значением!
         </p>

         <p>
            <b>Монограмма</b> может состоять как <b>из двух букв</b>, так и из сокращения <b>всего имени</b>.
            Фактически, это личный знак,
            который часто используют вместо подписи. <b>Фамильные монограммы</b> могут состоять из букв, принадлежащих
            имени
            одного человека или фамилии целой династии.
         </p>
         <p>
            <b>Подробнее</b>
         </p>
         <p>
            Имея тесные дружеские контакты с художниками, работающими в технике арабской вязи, мы можем предложить
            изготовить неповторимую и изысканную именную тугру (имя, фамилия и отчество владельца), выполненную в
            сложной технике ручной отрисовки с соблюдением самых древних и ярких традиций мусульманского графического
            искусства.
         </p>
         <p>
            Более сложные композиции (например, усложненные <b>фамильные монограммы</b>) представляют собой <b>
               художественные
               композиции, буквы
            </b> которых имеют особое начертание и технику исполнения, также глубину мысли и задумки.
            Отличие <b>монограммы и вензеля</b> в замысловатом переплетении букв инициалов, дополненном узорами и
            украшениями в
            виде витиеватостей, венков и корон, которые присутствуют в вензеле. Также вензелем часто называют
            художественную композицию, главным образом состоящую из одной буквы.
         </p>
      </div>

      <CategorySelect title="Как сделать монограмму?"
         description="Вы можете заказать монограмму (вензель), соответствующую одной из категорий сложности:" :anchors="{
            standard: 'gerb-standard',
            premium: 'gerb-premium',
            elite: 'gerb-elite',
         }" />

      <CategoryCard id="gerb-standard" title="Стандарт-категория" description="Нужен текст" :images="gallery.standard"
         aspect="1/1">
         <template #description>
            <p>
               Профессионально разработанная монограмма и составленная из соединённых между собой начальных букв имени с
               несложными переплетениями одна с другой. Лаконичная, оригинальная, классическая монограмма / вензель без
               дополнительного окружения. В ней отображается персональный стиль Владельца. Художник детально изучает
               информацию о владельце и в особой лаконичной технике отображает характерные черты будущего Владельца
               монограммы. Вы получаете гармоничный с Вашим стилем и характером символ, который будет прекрасной основой
               в формировании личного бренда.
            </p>
         </template>

         <template #result>
            <p>
               Изображение монограммы в контурном черно-белом исполнении в электронной версии. Векторный оригинал-макет
               + растровые форматы: JPEG, TIFF, CDR, Ai, EPS, PNG. Этот пакет гарантирует адаптивность изображения для
               широкого применения, видоизменения и пр.
            </p>
         </template>
      </CategoryCard>

      <NuxtImg class="w-full shadow-secondary aspect-[3.45/1]" src="/img/monograms/monogram_banner_1.webp" alt=""
         loading="lazy" />

      <CategoryCard id="gerb-premium" title="Премиуим-категория" description="нужен текст" :images="gallery.premium"
         reverse aspect="1/1">
         <template #description>
            <p>
               Профессионально разработанная сложная монограмма или вензель с замысловатым переплетением инициалов и
               добавлением к ним различных украшений, узоров и витиеватостей, окружение средней насыщенности. Данная
               категория может разрабатываться с наложением дополнительного смысла, переданного через систему символов в
               окружении.
            </p>
         </template>

         <template #details>
            <p>
               Для создания достойного уникального символа художник-дизайнер детально и чутко изучает информацию о
               Владельце, личных и деловых качествах, жизненных ценностях, принципов, моральных устоев и мировоззрения,
               сферу деятельности и профессию, семейные отношения и статус в обществе. То есть всю информацию, которую
               Заказчик посчитает уместной. На основе этого формируется особый образ, который реализуется сначала на
               бумаге под пером и кистью художника, а далее переносится в электронный формат.
            </p>

            <p>
               Вы получите монограмму – как символ чего-то особенного, известного Вам и кругу посвященных. Используя
               монограмму Премиум в личном или семейном брендинге, Вы покажите окружающим оригинальный взгляд на мир,
               особый статус и отношение к Жизни.
            </p>
         </template>

         <template #result>
            <ol>
               <li>
                  Изображение монограммы в контурном черно-белом (и/или цветовом) исполнении в электронной версии.
                  Векторный оригинал-макет + растровые форматы: JPEG, TIFF, CDR, Ai, EPS, PNG. Этот пакет гарантирует
                  адаптивность изображения для широкого применения, видоизменения и пр.
               </li>
               <li>
                  Составление семантического и стилистического описания монограммы / вензеля.
               </li>
               <li>
                  Результаты дополнительных работ, входящих в договоренность с Заказчиком на основании ценовой
                  политики Геральдической Мастерской.
               </li>
            </ol>
         </template>
      </CategoryCard>

      <NuxtImg class="w-full shadow-secondary aspect-[3.45/1]" src="/img/monograms/monogram_banner_2.webp" alt=""
         loading="lazy" />

      <CategoryCard id="gerb-elite" title="Элит-категория" description="нужен текст" :images="gallery.elite"
         aspect="1/1">
         <template #description>
            <p>
               Профессионально разработанная сложная монограмма или вензель с замысловатым переплетением инициалов и
               добавлением к ним различных украшений, узоров и витиеватостей, с насыщенным художественным окружением
               вокруг вензеля. По своей красоте, детализации проработки, тонкости художественной техники, глубине
               вкладываемого смысла, категория Элит уходит значительно выше всех предлагаемых вариантов.
            </p>

            <p>
               Тщательная разработка с использованием максимального количества элементов герба, неограниченные
               стилистические приемы, высочайшее мастерство художника, масштабная гербовая композиция, неповторимый
               внешний вид и глубочайший смысл.
            </p>
         </template>

         <template #details>
            <p>
               Окружение в данной категории монограмм выражает особый сугубо индивидуальный задум, олицетворяет
               характер, статус владельца, имеет глубокую смысловую нагрузку, раскрывает важные для Владельца понятия,
               ценности и мировоззрение. Монограммы Элит-категории могут позволить себе состоятельные и успешные люди.
               Монограммы ЭЛИТ – представляют собой образец шедевра геральдического и изобразительного искусства.
            </p>

            <p>
               Над проектом работает целая команда художников и дизайнеров, при содействии специалиста по геральдике и
               семантике. Данный проект требует больше времени для разработки идеи композиции, художественной отрисовки,
               и технической реализации. Для создания монограммы Элит подбираются особые специальные техники
               изобразительного и прикладного искусства. Будьте убеждены, Ваша монограмма будет поистине элитной и
               эксклюзивной, предметом гордости и олицетворением всего, что для Вас ценно, от сердца к серцу.
            </p>

            <p>
               Монограммы Элит – это элитный подарок, знак внимания и гордости, который заслуживает отдельного места в
               жизни человека, становясь его продолжением, увековечив свое имя в истории рода, компании, общества.
            </p>
         </template>

         <template #result>
            <ol>
               <li>
                  Картина с монограммой – художественный шедевр. Разработка монограммы и исполнение графического
                  оригинала на бумажном носителе (формат А-3 или А-2, техника исполнения — тушь, перо, или акварель,
                  оформление — багет, стекло).
               </li>
               <li>
                  Изображение монограммы в контурном черно-белом (и/или цветовом) исполнении в электронной версии.
                  Векторный оригинал-макет + растровые форматы: JPEG, TIFF, CDR, Ai, EPS, PNG. Этот пакет гарантирует
                  адаптивность изображения для широкого применения, видоизменения и пр.
               </li>
               <li>
                  Составление семантического и стилистического описания монограммы / вензеля.
               </li>
               <li>
                  Результаты дополнительных работ, входящих в договоренность с Заказчиком на основании ценовой политики
                  Геральдической Мастерской.
               </li>
            </ol>
         </template>
      </CategoryCard>

      <div>
         <p class="text-2xl uppercase font-semibold text-balance text-center px-40">
            Монограмма – символ индивидуальности
         </p>

         <Line icon="main" size="small" class="[&_.line]:min-w-60 mt-2" />

         <EditorEmbed class="shadow-secondary mt-4" :block="{
            service: 'youtube',
            embed: 'https://www.youtube.com/embed/YX1RM0sYJ-4'
         }" full />
      </div>

      <div>
         <p class="text-2xl uppercase font-semibold text-balance text-center px-40">
            Дополнительные УСЛУГИ:
         </p>

         <Line icon="main" color="gradient-gold" size="small" class="[&_.line]:min-w-60 mt-2 mb-5" />

         <TheSlider :data="12" :config="{ itemsToShow: 4, itemsToScroll: 1, gap: 16, snapAlign: 'start' }"
            v-slot="{ index }" aspect="3/4" :nav="{ type: 'static', size: 'full' }">
            <SliderCard v-bind="{
               path: '/img/services/2.webp',
               alt: 'asd',
               text: 'Описание идеи герба',
            }" />
         </TheSlider>
      </div>

      <div
         class="grid grid-cols-2 gap-x-2 [&_svg]:h-10 [&_svg]:text-accent-800 [&_svg]:shrink-0 [&_.icon-block]:flex [&_.icon-block]:gap-2 [&_.icon-block]:items-start">
         <div class="grid gap-2">
            <div class="icon-block">
               <IconsLily2 />
               <p>
                  Составление семантического и стилистического описания монограммы или вензеля;
               </p>
            </div>

            <div class="icon-block">
               <IconsLily2 />
               <p>
                  Наложение digital – эффектов, подстановка фонов, текстур, эффектная подача;
               </p>
            </div>

            <div class="icon-block">
               <IconsLily2 />
               <p>
                  Изготовление видео-презентации символа, intro, заставки, рекламные или поздравительные ролики;
               </p>
            </div>

            <div class="icon-block">
               <IconsLily2 />

               <div>
                  <p>Изготовление картины в выбранной технике:</p>
                  <ul class="list-disc list-inside pl-5">
                     <li>печать на бумаге, оформление – стекло, багет;</li>
                     <li>печать на холсте, оформление – багет;</li>
                     <li>картина – живопись, масло/холст, оформление – багет;</li>
                     <li>картина – графика, акварель, тушь/перо, фольгирование;</li>
                     <li>картина – гуашь-темпера;</li>
                  </ul>
               </div>
            </div>
         </div>

         <div class="grid gap-2">
            <div class="icon-block">
               <IconsLily2 />
               <p>Разработка сургучной печати или штампа с изображением монограммы или вензеля;</p>
            </div>
            <div class="icon-block">
               <IconsLily2 />
               <p>Изготовление ювелирных изделий с монограммой или вензелем;</p>
            </div>
            <div class="icon-block">
               <IconsLily2 />
               <p>Изготовление видео-презентации символа, intro, заставки, рекламные или поздравительные ролики;</p>
            </div>
            <div class="icon-block">
               <IconsLily2 />
               <p>
                  Изготовление различных изделий <NuxtLink to="/">(применение монограммы…)</NuxtLink>
               </p>
            </div>
         </div>
      </div>

      <div>
         <div class="grid gap-1">
            <p class="uppercase text-center text-2xl">
               ПРОЦЕСС РАЗРАБОТКИ МОНОГРАММЫ:
            </p>

            <p class="text-center text-xl text-accent-800">
               Работаем по всему миру.
            </p>

            <IconsMain class="text-accent-800 w-24 mx-auto" />
         </div>

         <Stages class="mt-10" />
      </div>

      <Certificate />
   </div>
</template>

<style scoped></style>