<script setup lang="ts">
definePageMeta({
   customTitle: {
      key: 'gerbs'
   },

   info: {
      key: 'gerbs',

      image: '/img/gerbs/main.webp',

      line: {
         icon: 'stars',
         size: 'small'
      }
   }
})

const isLoaded = ref(false)
const isPlaying = ref(false)
const video = ref()
const stateChange = (event: YT.OnStateChangeEvent) => {
   isPlaying.value = event.data === 1
}

const gallery = {
   standard: [
      ...Array.from({ length: 10 }).map(item => ({ path: '/img/services/2.1.webp', alt: undefined }))
   ],
   premium: [
      ...Array.from({ length: 10 }).map(item => ({ path: '/img/services/2.1.webp', alt: undefined }))
   ],
   elite: [
      ...Array.from({ length: 10 }).map(item => ({ path: '/img/services/2.1.webp', alt: undefined }))
   ],
}
</script>

<template>
   <div class="grid gap-16">
      <div class="">
         <h2 class="text-2xl uppercase font-semibold text-balance text-center px-40">
            Разработка и изготовление
            фамильного (персонального) герба
         </h2>
         <Line icon="main" size="small" class="[&_.line]:min-w-60 mt-2" />
      </div>

      <div class="grid gap-4">
         <p>
            <b>Для того чтобы иметь свой герб, не обязательно принадлежать к определенному сословию или быть
               дворянином.</b>
            <br>
            Современное гражданское право, традиции европейской геральдики не устанавливают никаких ограничений в этой
            связи. <NuxtLink class="accent" to="/">(узнать об этом больше…)</NuxtLink>
         </p>

         <p>
            <b>Личный (фамильный) герб</b> – это, прежде всего, воплощение статуса своего владельца (армигера),
            олицетворение
            его чести и достоинства, ценностей и качеств. Это ключевой элемент персонального стиля, своеобразное
            средство самовыражения, символ родственных и семейных связей.
         </p>

         <p>
            <b>Разработка герба</b> – кропотливый, трудоёмкий и ответственный процесс, над которым трудятся специалисты:
            геральдисты, художники и дизайнеры. На стоимость изготовления фамильного герба, герба семьи, рода, фирмы
            влияют несколько факторов: сложность, объем работ и мастерство исполнения. Исходя из опыта и для Вашего
            удобства, мы предлагаем три категории гербов:
         </p>
      </div>

      <CategorySelect title="Как сделать монограмму?"
         description="Вы можете заказать монограмму (вензель), соответствующую одной из категорий сложности:" :anchors="{
            standard: 'gerb-standard',
            premium: 'gerb-premium',
            elite: 'gerb-elite',
         }" />

      <CategoryCard id="gerb-standard" title="Стандарт-категория" description="Композиция герба сдержанная, лаконичная, но в то же время индивидуальная и
               неповторимая." :images="gallery.standard" aspect="1/1">
         <template #description>
            <p>
               <b class="text-accent-800">Герб Стандарт категории</b> положит начало Вашему персональному стилю, бренду
               Вашей семьи. Вы уверенно
               и
               бескомпромиссно заявите о себе, зафиксировав Вашу жизненную позицию, Ваш морально-этический кодекс. Вы
               личность, и вправе иметь свой герб. Умный, красивый, говорящий символ.
            </p>

            <p>
               Герб Стандарт содержит все обязательные атрибуты традиционного исторического герба, а символы раскрывают
               конкретные понятия. Композиция герба сдержанная, лаконичная, но в то же время индивидуальная и
               неповторимая.
            </p>
         </template>

         <template #details>
            <p>
               Завтра Вы используете его в Вашей одежде, в вышивке, в ювелирных украшениях, в оформлении Вашего дома, в
               тюнинге Вашего автомобиля. Вы – личность, Ваш герб – Ваше слово миру! Результатом работ является
               изображение герба (его электронная версия, оригинал-макет) адаптированное для широкого
               применения. Описание герба, оформленное на фирменном бланке. Каждый символ и элемент будет расшифрован
               таким образом, что читатель увидит послание, прочтет именно то, что олицетворяет членов семьи и все их
               ценности.
            </p>
         </template>

         <template #result>
            <ol>
               <li>
                  Изображение герба в контурном и цветовом исполнении в электронной версии. Векторный
                  оригинал-макет + растровые форматы: JPEG, TIFF, CDR, Ai, EPS, PNG. Этот пакет гарантирует
                  адаптивность изображения для широкого применения.
               </li>
               <li>
                  Семантическое и стилистическое описание герба в электронном текстовом документе. При желании,
                  оформление на специальный фирменный бланк.
               </li>
               <li>
                  Бонусы от геральдической мастерской: дизайн — идеи по применению, бесплатный просчет изделия,
                  скидки на изготовление изделий с гербом.
               </li>
            </ol>
         </template>
      </CategoryCard>

      <CategoryCard id="gerb-premium" title="Премиуим-категория" description="нужен текст" :images="gallery.premium"
         reverse aspect="1/1">
         <template #description>
            <p>
               <b class="text-accent-800">Герб Премиум категории</b> это герб-произведение искусства, посвященное Вам и
               Вашим близким. Сложная
               художественная композиция раскрывает более глубокие моральные и духовные понятия, тонкости характера и
               стиля армигера и его семьи. Герб обогащен дополнительными элементами, которые по своей красоте и
               детализации проработки поднимают изображение герба на высокий уровень художественного искусства.
               Появляются щитодержатели, которые используются в исключительных случаях для повышения статуса герба,
               олицетворяя самих армигеров, либо выступая в роли защитников семьи и фамильных ценностей. Категория
               Премиум – это более объемная платформа для отображения ценностей, традиций, внутреннего мира армигера и
               его семьи.
            </p>
         </template>

         <template #details>
            <p>
               Присутствует обязательная авторская идея. Детальное внимательное изучение информации о гербовладельцах
               позволяет глубоко и тонко прочувствовать внутренний мир и отобразить должным образом в гербовой
               композиции. Данная категория гербов имеет уникальный способ создания. Электронная версия создана на
               основе авторской ручной графики в технике гравюры. Герб отрисовывается вручную талантливейшим художником,
               и далее профессиональный дизайнер под чутким надзором осуществляет перевод герба в электронный
               формат. Представив его современникам, Вы с достоинством расскажете о себе и о своей жизненной позиции.
               Родные будут еще больше Вами гордиться, а коллеги, партнеры и соседи отметят для себя Вашу неординарность
               и глубину. Потомки получат веское основание вспоминать Вас с благодарностью, с достоинством используя Ваш
               герб и продолжая уже Вашу династию.
            </p>
         </template>

         <template #result>
            <ol>
               <li>
                  Изображение герба в контурном и цветовом исполнении в электронной версии. Векторный оригинал-макет +
                  растровые форматы: JPEG, TIFF, CDR, Ai, EPS, PNG. Этот пакет гарантирует адаптивность изображения для
                  широкого применения.
               </li>
               <li>
                  Расширенное семантическое и стилистическое описание герба в электронном текстовом документе, а также
                  оформленное на фирменном бланке.
               </li>
               <li>
                  Особые бонусы от геральдической мастерской: дизайн — проект по применению, бесплатный просчет
                  изделия, скидки на изготовление изделий с гербом.
               </li>
            </ol>
         </template>
      </CategoryCard>

      <CategoryCard id="gerb-elite" title="Элит-категория" description="нужен текст" :images="gallery.elite"
         aspect="1/1">
         <template #description>
            <p>
               <b class="text-accent-800">Герб Элит категории</b> представит Вас и Вашу семью в наилучших традициях
               классической мировой геральдики.
               Все увидят, что Вы — выдающаяся и неповторимая личность, а Ваша семья богата моральными ценностями,
               культурой и своей историей. Многие переоценят свое отношение к Вам, воздав Вам по заслугам. Причиной тому
               станет шедевр геральдики и изобразительного искусства — фамильный герб, выполненный по мотивам нашей
               авторской программы «Восстановления императорской геральдики».
            </p>

            <p>
               Тщательная разработка с использованием максимального количества элементов герба, неограниченные
               стилистические приемы, высочайшее мастерство художника, масштабная гербовая композиция, неповторимый
               внешний вид и глубочайший смысл.
            </p>
         </template>

         <template #details>
            <p>
               Все элементы в гербе Элит взаимодействуют на тончайшем уровне, переплетаясь по смыслу и геральдическому
               значению, раскрывают целую историю рода, олицетворяют владельцев, содержат послания современникам и
               будущим поколениям. Кроме того, эта категория гербов имеет уникальный способ создания. Над проектом
               трудятся самые профессиональные и талантливые художники Геральдической Мастерской. Изначально каждый
               элемент герба по отдельности рисует художник вручную, а далее на основе ручной графики создаются
               компьютерные макеты. Художник дизайнер выполняет электронные макеты герба под внимательным надзором
               главного художника. Такой способ создания помогает отобразить характер даже в привычных фигурах,
               стилизовав их, а так же символ смотрится более сложным и интересно проработанным. Практика показала, что
               данного результата можно добиться только ручными техниками. Детализация и тонкость работы впечатлит даже
               самого требовательного эстета. Данная категория гербов – это авторский проект Геральдической мастерской —
               «Восстановления императорской геральдики». В итоге Гербовладелец получит неповторимый герб — шедевр
               изобразительного искусства на картине и все необходимые электронные оригинал-макеты для использования
               герба в личной жизни, деловой сфере. Став обладателем такого герба Вы тем самым оставите след в истории.
            </p>
         </template>

         <template #result>
            <ol>
               <li>
                  Оригинал изображения: картина – шедевр изобразительного искусства. Техника исполнения на выбор
                  Заказчика: акварель, тушь/перо, фольгирование, масло/холст, гуашь-темпера.
               </li>
               <li>
                  Изображение герба в контурном и цветовом исполнении в электронной версии. Векторный оригинал-макет +
                  растровые форматы: JPEG, TIFF, CDR, Ai, EPS, PNG. Этот пакет гарантирует адаптивность изображения для
                  широкого применения.
               </li>
               <li>
                  Полное семантическое и стилистическое описание герба в электронном текстовом документе, а также
                  оформленное на фирменном бланке.
               </li>
               <li>
                  Карта клиента Геральдической Мастерской с индивидуальные бонусными программами, дизайн — проект по
                  применению, просчеты изделий, программы лояльности, подарки.
               </li>
            </ol>
         </template>
      </CategoryCard>

      <div>
         <p class="text-2xl uppercase font-semibold text-balance text-center px-40">
            Основоположники развития и востановления традиций классической мировой геральдики
         </p>

         <Line icon="main" size="small" class="[&_.line]:min-w-60 mt-2" />

         <div class="flex items-center justify-center p-5">
            <ScriptYouTubePlayer class="aspect-video! w-full! [&_img]:object-cover! shadow-secondary" ref="video"
               video-id="4gev9nDnbwY" @ready="isLoaded = true" @state-change="stateChange">
               <template #awaitingLoad>
                  <div class="absolute left-1/2 top-1/2 transform -translate-x-1/2 -translate-y-1/2">
                     <svg class="w-auto h-14" viewBox="0 0 68 48">
                        <path
                           d="M66.52,7.74c-0.78-2.93-2.49-5.41-5.42-6.19C55.79,.13,34,0,34,0S12.21,.13,6.9,1.55 C3.97,2.33,2.27,4.81,1.48,7.74C0.06,13.05,0,24,0,24s0.06,10.95,1.48,16.26c0.78,2.93,2.49,5.41,5.42,6.19 C12.21,47.87,34,48,34,48s21.79-0.13,27.1-1.55c2.93-0.78,4.64-3.26,5.42-6.19C67.94,34.95,68,24,68,24S67.94,13.05,66.52,7.74z"
                           fill="#f00" />
                        <path d="M 45,24 27,14 27,34" fill="#fff" />
                     </svg>
                  </div>
               </template>

               <template #placeholder="{ placeholder }">
                  <img class="size-full" :src="placeholder.replace('sddefault', 'hqdefault')" alt="Video Placeholder">
               </template>
            </ScriptYouTubePlayer>
         </div>
      </div>

      <div>
         <p class="text-2xl uppercase font-semibold text-balance text-center px-40">
            Дополнительные УСЛУГИ:
         </p>

         <Line icon="main" color="gradient-gold" size="small" class="[&_.line]:min-w-60 mt-2 mb-5" />

         <TheSlider :data="12" :config="{ itemsToShow: 4, itemsToScroll: 1, gap: 16 }" v-slot="{ index }" aspect="3/4"
            :nav="{ type: 'static', size: 'full' }">
            <SliderCard v-bind="{
               path: '/img/services/2.webp',
               alt: 'asd',
               text: 'Описание идеи герба',
            }" />
         </TheSlider>
      </div>

      <div
         class="grid grid-cols-2 gap-x-2 [&_svg]:h-10 [&_svg]:text-accent-800 [&_svg]:shrink-0 [&_.icon-block]:flex [&_.icon-block]:gap-2 [&_.icon-block]:items-start">
         <div class="grid gap-2">
            <div class="icon-block">
               <IconsLily2 />
               <p>Блазон – описание герба на языке геральдики (необходимо для регистрации).</p>
            </div>

            <div class="icon-block">
               <IconsLily2 />
               <p>
                  Описание идеи герба – раскрывает смысл и значение каждого элемента герба в целом, в отношении его
                  владельца,
                  армигера.
               </p>
            </div>

            <div class="icon-block">
               <IconsLily2 />

               <div>
                  <p>Изображение герба в вариантах:</p>
                  <ul class="list-disc list-inside pl-5">
                     <li>печать на бумаге, оформление – стекло, багет;</li>
                     <li>печать на холсте, оформление – багет;</li>
                     <li>картина – живопись, масло/холст, оформление – багет;</li>
                     <li>картина – графика, акварель, тушь/перо, фольгирование;</li>
                     <li>картина – гуашь-темпера;</li>
                  </ul>
               </div>
            </div>
         </div>

         <div class="grid gap-2">
            <div class="icon-block">
               <IconsLily2 />
               <p>Разработка сургучной печати или штампа с изображением герба;</p>
            </div>
            <div class="icon-block">
               <IconsLily2 />
               <p>Разработка флага, знамени, штандарта;</p>
            </div>
            <div class="icon-block">
               <IconsLily2 />
               <p>Написание Гимна, либо особой мелодии;</p>
            </div>
            <div class="icon-block">
               <IconsLily2 />
               <p>Разработка ювелирных изделий с изображением герба</p>
            </div>
            <div class="icon-block">
               <IconsLily2 />
               <p>Создание презентационных материалов: видеоролик, слайд-шоу, баннеры и пр.</p>
            </div>
            <div class="icon-block">
               <IconsLily2 />
               <p>Изготовление изделий с изображением герба. <NuxtLink to="/">(применение герба…)</NuxtLink>
               </p>
            </div>
         </div>
      </div>

      <div>
         <div class="grid gap-1">
            <p class="uppercase text-center text-2xl">
               ПРОЦЕСС РАЗРАБОТКИ ГЕРБА:
            </p>

            <p class="text-center text-xl text-accent-800">
               Работаем по всему миру.
            </p>

            <IconsMain class="text-accent-800 w-24 mx-auto" />
         </div>

         <Stages class="mt-10" />
      </div>

      <Certificate />
   </div>
</template>

<style scoped></style>